//================================================================
class dicer
{
	//____________________________________________________________
	private:
	
	bool boolen = false;
	T *item = new T [];
	T count;
	//____________________________________________________________
	public:
	
	dicer () : count(0) {}
	
	bool append // по условию member функция append должна быть bool, 
              //ищу способы применения этого типа данных в данной программе, 
              //прдположительно функция будет возвращать true при count > 15 
              //и в зависимости от того что она вернёк должно выводиться сообщение 
              //о достигнутой границе массива.
	{	
		for (T count = 0; count < 15; count++)
			{
			std::cout << "Введите число от 1 до 6" std::endl;
			std::cin >> drop;
			std::cout << "выпало число" << drop << std::endl;
			item[i] = drop;
			boolen = count < 15; 
			};
	};
	void clear{
		delete [] item;
	};
	//____________________________________________________________
};
//================================================================
